//Напишите программу замена элементов массива: положительные элементы замените 
//на соответствующие отрицательные, и наоборот.
// [-4, -8, 8, 2] -> [4, 8, -8, -2] 

int[] arr = GetRandomArray(10);
PrintArray(arr);
System.Console.WriteLine();
PrintArray(ReplaceNum(arr));

int[] ReplaceNum(int[] array)
{
    for(int i = 0; i < array.Length; i++)
    {
        array[i] *= -1;
    }
    return array;
}

int[] GetRandomArray(int length)
{
  int[] result = new int[length];

  for(int i = 0; i < length; i++)
  {
    result[i] = new Random().Next(-100, 100);
  }
  return result;
}

void PrintArray(int[] arr)
{
  foreach(int item in arr)
  {
    Console.Write(item + " ");
  }
}